{
    "company_name": "Beyond",
    "role_title": "Senior Data Scientist",
    "name_param": "beyond-senior-data-scientist",
    "role_description": "\nWho you are\nResult-oriented - You manage the trade-offs between speed and quality and are able to find the right balance. You would rather ship, measure, learn and iterate, than coding the perfect component on the first try\nCollaborative - You enjoy exploring and committing as a team, you welcome others' ideas, and you value teamwork and team decision-making over being right and having things going your way\nCurious - You are driven to understand how things work or why they don't. You are interested in finding out how your work impacts our customers and the world they live in\nResilient - You can adapt and roll up your sleeves to help others. You operate at a stable pace with visibility most of the time and you are ready to embrace change when it happens5+ years of experience as a Data Scientist, 10+ years of experience in Saa\nS overall\nExpertise in Machine Learning and Statistical Analysis techniques such as STL/LOESS, SGD, Random Forests, MRL, etc\nExpertise in Python, SQL, pandas, scipy, scikit-learn, statsmodel, or other related Data Science frameworks\nA demonstrated ability to produce models that measurably seize business opportunities or solve business problems\nExperience in revenue management airlines industries, or subjects including pricing is a plus\nExperience with Spark or similar data analysis frameworks is a plus\nExperience designing and implementing validation via methods like A/B testing and synthetic controls is a plus\n\nWhat the job involves\nIt's with that in mind that Beyond is looking to add a Senior Data Scientist to our growing team.You will have the opportunity to leverage AI, ML, and statistical techniques to innovate on the core product at Beyond - our dynamic pricing algorithm for short-term rentals.You’ll work closely with experts from Revenue Management as well as data engineers to identify, design, test, and implement improvements using a modern data processing workflow and tools\nCollaborating with the Revenue Management team to prioritize deliverables and ensure timely, accurate execution, including overseeing the work of 2 Data Scientists\nWorking with data engineers to handle data processing needs and shepherd algorithm changes into our production environment\nDesigning, and implementing sophisticated Machine Learning solutions and time series models to forecast trends and behaviors, optimize business processes, and enhance predictive accuracy in real-time decision-making environments to drive customers revenue performance\nMentoring fellow Data Scientists and promoting adoption of industry best practices\nApplication process\nSo what can you expect after you apply? Your application will be personally reviewed by a member of the Beyond hiring team and if there is a match in your experience and the role, you will:Have a video conversation with someone on our Recruiting team. This is a high-level conversation about your experience and interest, but also an opportunity for you to learn more about us\nInterview with the hiring manager\nComplete a skills assessment & screening\nComplete a technical Interview\nHave a final interview with our VP of Engineering",
    "key_skills": [
        "SQL",
        "Python",
        "Spark",
        "Pandas",
        "Scikit-Learn"
    ],
    "company_sectors": [
        "B2B",
        "Big data",
        "Renting",
        "SaaS"
    ]
}